# 정수 4를 1, 2, 3의 합으로 나타내는 방법은 총 7가지가 있다. 합을 나타낼 때는 수를 1개 이상 사용해야 한다.
# https://www.acmicpc.net/problem/15988

lst = [0,1,2,4]
def find_123(m):
    if m < len(lst):
        return lst[m]
    else:
        while(m>=len(lst)):  # m = 10, length = 3, 즉 f(2)까지 있음
            length = len(lst)
            lst.append((lst[length-1]+lst[length-2]+lst[length-3])%1000000009)
        return lst[m]
    

n = int(input())
for _ in range(n):
    m = int(input())
    print(find_123(m))

# 0 : f(0) = 0
# 1 : 1 -> f(1) = 1 
# 2 : 1+1, 2 -> f(2) = 2
# 3 : 1+1+1, 1+2, 2+1, 3 -> f(3) = 4
# 4 : 1+1+1+1, 1+2+1, 1+1+2, 2+1+1, 3+1, 1+3, 2+2 -> f(4) = 7
# 5 : 1+1+1+1+1, 1+1+1+2, 1+1+2+1, 1+2+1+1, 2+1+1+1, 1+2+2, 2+1+2, 2+2+1, 3+1+1, 1+3+1, 1+1+3, 3+2, 2+3 f(5) = 13
# 6 : 1+1+1+1+1+1, 1+1+1+2+1, 1+1+2+1+1, 1+2+1+1+1, 2+1+1+1+1, 1+2+2+1, 2+1+2+1, 2+2+1+1, 3+1+1+1, 1+3+1+1, 1+1+3+1, 3+2+1, 2+3+1 1+1+1+1+2, 1+2+1+2, 1+1+2+2, 2+1+1+2, 3+1+2, 1+3+2, 2+2+2, 1+1+1+3, 1+2+3, 2+1+3, 3+3 f(6) = 24
# 7 f(n) = f(n-1) + f(n-2) + f(n-3) 
